[
  {
    "name": "Riverside Market",
    "address": "12 Market Rd, Andrew's Chamber",
    "description": "A bustling open-air market with local produce, artisans, and street food.",
    "fullDescription": "Riverside Market gathers local farmers and makers every weekend. Expect fresh produce, artisanal goods, live music, and a family-friendly atmosphere.",
    "image": "item1.webp"
  },
  {
    "name": "Old Town Museum",
    "address": "3 Heritage Square, Andrew's Chamber",
    "description": "A small museum showcasing the history and culture of our town.",
    "fullDescription": "The Old Town Museum features rotating exhibits about local history and community heroes. Guided tours are available on weekends.",
    "image": "item2.webp"
  },
  {
    "name": "Sunset Park",
    "address": "River St & 8th Ave",
    "description": "Popular park with walking trails, picnic areas and great sunset views.",
    "fullDescription": "Sunset Park includes a riverside promenade, playgrounds, and native-plant gardens. It's a favorite for evening walks and weekend picnics.",
    "image": "item3.webp"
  },
  {
    "name": "Artisan Row",
    "address": "45 Artisan Ln",
    "description": "A row of independent galleries, studios and coffee shops.",
    "fullDescription": "Artisan Row supports local creatives with studios and galleries. Monthly art walks and pop-up shops are common.",
    "image": "item4.webp"
  },
  {
    "name": "Civic Theater",
    "address": "1 Main Street",
    "description": "Historic theater showing live plays and community performances.",
    "fullDescription": "The Civic Theater hosts plays, music nights, and educational workshops. Check the seasonal calendar for tickets and volunteer opportunities.",
    "image": "item5.webp"
  },
  {
    "name": "Harbor Walk",
    "address": "Harbor Rd",
    "description": "A scenic promenade along the water with cafes and boat views.",
    "fullDescription": "Harbor Walk is perfect for morning runs and afternoon strolls. Local seafood restaurants and an occasional weekend market line the promenade.",
    "image": "item6.webp"
  },
  {
    "name": "Botanical Conservatory",
    "address": "22 Greenway Blvd",
    "description": "Glasshouse and gardens featuring regional plants and seasonal displays.",
    "fullDescription": "The Conservatory offers seasonal flower exhibits, educational programs, and a peaceful environment for photographers and families.",
    "image": "item7.webp"
  },
  {
    "name": "Tech Hub",
    "address": "7 Innovation Park",
    "description": "Co-working and startup incubator supporting local entrepreneurs.",
    "fullDescription": "Tech Hub hosts mentorship programs, workshops, and networking events for startups and freelancers in the region.",
    "image": "item8.webp"
  }
]
